УТ/src/DataProcessors/CRM_НастройкаСценарияПродаж/CRM_НастройкаСценарияПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_НастройкаСценарияПродаж</name>
</mdclass:DataProcessor>

УТ/src/Catalogs/CRM_УчетныеЗаписиМессенджеров/CRM_УчетныеЗаписиМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УчетныеЗаписиМессенджеров</name>
  <predefined>
    <items>
      <name>B2BПортал</name>
      <description>B2B портал</description>
    </items>
    <items>
      <name>СистемаВзаимодействия</name>
      <description>Система взаимодействия</description>
    </items>
  </predefined>
  <attributes>
    <name>CRM_ВариантАвтосозданияКлиентов</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>EnumRef.CRM_ВариантыАвтосозданияКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОбрабатыватьОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерГруппа</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерСтатусРаботы</name>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СоздаватьПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокЖизниОбращения</name>
    <comment>Время жизни обращения (дней)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Включена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьWebhook</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодWebhook</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПросмотрСообщенийВсемПользователям</name>
    <comment>Разрешить просмотр сообщений всем пользователям, независимо от настройки доступа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМессенджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияИспользованияПриняты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметровДоступа</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_ПравилаОбработки</name>
    <attributes>
      <name>УсловиеОбработки</name>
      <type>
        <types>CatalogRef.CRM_УсловияОбработкиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоОбработки</name>
      <type>
        <types>CatalogRef.CRM_ПравилаОбработкиОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Сценарии</name>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/DataProcessors/CRM_НастройкаСценарияПродаж/Forms/ФормаДобавленияЛида/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДополнительноеУсловие = "";
	Если Параметры.Источник = "Источник" Тогда
		ВидСправочника = "CRM_ИсточникиПолученияЛидов";
		Заголовок = "Источники получения заявок";
		ДополнительноеУсловие = "И ИсточникЛидов.Включено";
	ИначеЕсли Параметры.Источник = "Почта" Тогда
		ВидСправочника = "УчетныеЗаписиЭлектроннойПочты";
		Заголовок = "Учетные записи электронной почты";
	ИначеЕсли Параметры.Источник = "Мессенджер" Тогда
		ВидСправочника = "CRM_УчетныеЗаписиМессенджеров";
		Заголовок = "Учетные записи мессенджеров и социальных сетей";
		ДополнительноеУсловие = "И ИсточникЛидов.Включена";
	КонецЕсли;
	СписокЛидов.ТекстЗапроса = "ВЫБРАТЬ
		                           |	ИсточникЛидов.Ссылка КАК Ссылка,
		                           |	ИсточникЛидов.CRM_ИсточникЛидов КАК CRM_ИсточникЛидов
		                           |ИЗ
		                           |	Справочник." + ВидСправочника + " КАК ИсточникЛидов
		                           |ГДЕ НЕ ИсточникЛидов.ПометкаУдаления
		                           |" + ДополнительноеУсловие;
	СписокЛидов.ОсновнаяТаблица = "Справочник." + ВидСправочника;
	Элементы.СписокЛидов.РежимВыбора = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокЛидовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Элемент.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура СписокЛидовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Закрыть(Элемент.ВыделенныеСтроки);
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокЛидовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если ВидСправочника = "CRM_УчетныеЗаписиМессенджеров" Тогда
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьЗавершение", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.CRM_ВыборКаналаДиалогов", , ЭтотОбъект, , , , ОписаниеОповещения,
			 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗавершение(Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Если ВидСправочника = "CRM_УчетныеЗаписиМессенджеров" Тогда
			ПараметрыФормы = Новый Структура("ТипМессенджера", Результат);
			ОткрытьФорму("Справочник.CRM_УчетныеЗаписиМессенджеров.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
